app/Controllers/Contacts.php

    public function new()
    {
        $data['groups'] = $this->group->findAll();
---
SELECT *
FROM `groups`
WHERE `groups`.`deleted_at` IS NULL

    public function edit($id = null)
    {
        $contact = $this->contact->find($id);
        if(is_object($contact)) {
            $data['contact'] = $contact;
            $data['groups'] = $this->group->findAll();
---
SELECT *
FROM `groups`
WHERE `groups`.`deleted_at` IS NULL