app/Controllers/Gawe.php

    public function index()
    {
        $builder = $this->db->table('gawe');
        $query   = $builder->get()->getResult();
---
SELECT *
FROM `gawe`

    public function edit($id = null)
    {
        if($id != null) {
            $query = $this->db->table('gawe')->getWhere(['id_gawe' => $id]);
---
SELECT *
FROM `gawe`
WHERE `id_gawe` = '1'