app/Models/ContactModel.php

SELECT *
FROM `contacts`
JOIN `groups` ON `groups`.`id_group` = `contacts`.`id_group`
---
    function getAll() {
        $builder = $this->db->table('contacts');
        $builder->join('groups', 'groups.id_group = contacts.id_group');
        $query = $builder->get();